Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServerProxy.GetDataSchema
Obtains the schema of the ESEntity.
Returns:
Null if the server has no data.
Since:
2014

Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServerProxy.IsApplicable(Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData)
Check if the server is applicable for the pipe fitting or pipe accessory.
data:
The input data of the calculation.
Since:
2014

Autodesk.Revit.DB.Plumbing.IPipeFittingAndAccessoryPressureDropServerProxy.Calculate(Autodesk.Revit.DB.Plumbing.PipeFittingAndAccessoryPressureDropData)
Calculate the pipe fitting and pipe accessory coefficient.
data:
The input and output data of the calculation.
Returns:
True if calculation succeeds.
False if calculation fails.
Since:
2014